content_org/computer.org
#+TITLE: Computer Science
#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: computer
#+FILETAGS:computer
#+HUGO: more
#+SEQ_TODO: TODO NEXT DONE
#+HUGO_AUTO_SET_LASTMOD: t
#+hugo_front_matter_key_replace: description>summary
#+SETUPFILE: ~/.spacemacs.d/org-templates/math.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../static/css/worg.css"  />

** DONE Python numpy tutorial                      :python:
   CLOSED: [2018-06-03 Sun 17:35]
   :PROPERTIES:
   :EXPORT_FILE_NAME: python-numpy-tutorial
   :EXPORT_DATE: <2018-06-02 Sat 09:26>
   :EXPORT_DESCRIPTION: As a replacement of Matlab (I miss Matlab for its clean and concise grammar), numpy is the core library for scientific computing in Python. It provides a high-performance multidimensional array object, and tools for working with these arrays.
   :END:
   :LOGBOOK:
   - CLOSING NOTE [2018-06-03 Sun 17:35] \\
     done with the numpy tutorial
   CLOCK: [2018-06-02 Sat 21:30]--[2018-06-02 Sat 22:17] =>  0:47
   CLOCK: [2018-06-02 Sat 18:46]--[2018-06-02 Sat 21:29] =>  2:43
   CLOCK: [2018-06-02 Sat 09:37]--[2018-06-02 Sat 12:45] =>  3:08
   CLOCK: [2018-06-02 Sat 09:27]--[2018-06-02 Sat 09:37] =>  0:10
   :END:
*** Python
    [2018-06-02 Sat 09:38]

    As a high-level dynamically typed multiparadigm programming language, python
    is attracts more and more attensions. Because of its strict indentation
    requirement, python code has some beauty in it.


    Using Emacs and IPython, I finished the [[http://cs231n.github.io/python-numpy-tutorial/][tutorial]] written by [[https://cs.stanford.edu/people/jcjohns/][Justin Johnson]] .
    The following sections share the same architecture as in the tutorial.
    However, for the sake of learning, I input all the code and add my
    understanding. Because I learn Matlab beforehand, some differencec between
    Matlab and Python are mentioned. During the learning, I use python 3.6
    instead of python 3.5 in the tutorial.
**** Basic data types
    [2018-06-02 Sat 12:03]

    Like most languages, Python has a number of basic types including integers,
    floats, booleans, and strings.
***** numbers
     [2018-06-02 Sat 12:04]

     Numbers include integer and float types and work as in other language.

     #+begin_src python
     x = 3
     print(type(x)) # Prints "<class 'int'>"
     print(x)       # Prints "3"
     print(x+1)     # Addition; prints "4"
     print(x-1)     # Subtraction; print "2"
     print(x*2)     # Multiplication; prints "6"
     print(x**2)    # Exponentiation; print "9"
     x += 1
     print(x)       # Print "4"
     x *= 2
     print(x)       # Print "8"
     y = 2.5
     print(type(y)) # Print "<class 'float'>"
     print(y, y+1, y*2, y**2) # Prints "2.5 3.5 5.0 6.25"
     #+end_src

     Python has =+==  , =*== , =-== , =/==  operators. However =a++= and =a--=
     are not supported in Python.


***** Booleans
      [2018-06-02 Sat 18:46]

      Different from Matlab, Python use =and= , =or= to implement Booleans
      logic. In Matlab, which was implemented using =&&= and =||= .

      #+begin_src python
      t = True
      f = False
      print(type(t)) # Prints "<class 'bool'>"
      print(t and f) # logical AND; prints "False"
      print(t or f)  # logical or; prints "True"
      print(not t)   # logical NOT; print "False"
      print(t != f)  # logical XOR; prints "True"
      #+end_src

      In matlab "not equal" was symbolized by =~== instead of =!== .
***** Strings
      [2018-06-02 Sat 19:28]

      I think Python support more on strings.

      #+begin_src python
      hello = 'hello' # String lterals can use single quotes
      world = "world" # double quotes; has the same effects as single ones
      print(hello)    # Prints hello
      print(len(hello)) #String length; prints "5"
      hw = hello + ' ' + world # String concatenation
      print(hw) # prints "hello world"
      hw12 = '%s %s %d' % (hello,world,12)
      print(hw12) # Prints "hello world 12"
      #+end_src

      In Python3.6, there is a handy sting called f-string. The last two lines
      code above can be written as:

      #+begin_src python
      print(f'{hello} {world} 12')
      #+end_src

      Quite a lot of methods are provided for strings:
      #+begin_src python
      s = "hello"
      print(s.capitalize())   # Capitalize a string; prints "Hello"
      print(s.upper()) # Print "HELLO"
      print(s.rjust(7)) # right-justify a string, padding with spaces;
      print(s.center(7)) # center a string, padding with space;
      print(s.replace('l','(ell)')) # replace all instances of one substring
      #with another
      #+end_src

      More methods can be found [[https://docs.python.org/3.5/library/stdtypes.html#string-methods][in the document]].
**** Containers
     [2018-06-02 Sat 19:51]

     There are four built-in container types: lists, dictionaries, sets and
     tuples.
***** lists
      [2018-06-02 Sat 19:57]

      A list is the Python equivalent of an array, but is resizeable and can
      contain element of different types.

      #+begin_src python
      xs = [3,1,2] # Create a list
      print(xs,xs[2]) # prints "[3,1,2] 2"
      print(xs[-1]) # print the last element; print "2"
      xs[2] = 'foo' # different  types
      print(xs) # print "[3,1,'foo']"
      xs.append('bar')
      print(xs) # print "[3,1,'foo','bar']"
      x = xs.pop()
      print(x,xs) # prints "bar [3,1,'foo']"
      #+end_src

      As usual, you can find all the gory details about lists [[https://docs.python.org/3.5/tutorial/datastructures.html#more-on-lists][in the document]].

      If you are impatient to access list elements one at a time, slicing is an
      excellent choice to access more than one elements in a list.

      #+begin_src python
      nums = list(range(5)) # range is a built-in function that create a list of integers
      print(nums) # print "[0,1,2,3,4]"
      print(nums[2:4]) # get a slice from index 2 to 4 (exclusive);print "[2,3]"
      print(nums[2:]) # prints "[2,3,]"
      print(nums[:2]) # get a slice from the start to index 2(exclusive). prints "[0,1]"
      print(nums[:]) # the whole list
      print(nums[:-1]) # slice indices can be negative; prints "[0,1,2,3]"
      nums[2:4] = [8,9]
      print(nums) # Prints "[0,1,8,9,4]"
      #+end_src

      You can also loop over the elements of a list like this:
      #+begin_src python
      animals = ['cat', 'dog','monkey']
      for animal in animals:
          print(animal)
      #+end_src

      If you want access to the index of each element within the body of a loop,
      use the built-in =enumerate= function

      #+begin_src python
      animals = ['cat','dog','monkey']
      for idx,animal in enumerate(animals):
          print('#%d: %s' % (idx + 1,animal))
      #+end_src


      Next, I want to show a point which does not exists in Matlab: list
      comprehensions. Consider the following code:
      #+begin_src python
      nums = [0,1,2,3,4]
      squares = []
      for x in nums:
          squares.append(x ** 2)
      print(squares)
      #+end_src

      Using the list comprehensions, we implement the above with extremely short
      code.

      #+begin_src python
      nums = [0,1,2,3,4]
      squares = [x ** 2 for x in nums]
      print(squares)
      #+end_src

      You do not have to define =square= before you use it. list comprehensions
      can also contain conditions:

      #+begin_src python
      nums = [0,1,2,3,4]
      even_squares = [x ** 2 for x in nums if x % 2 == 0]
      print(even_squares)
      #+end_src
