content/computer/python-numpy-tutorial.md
+++
title = "Python numpy tutorial"
author = ["Eason Zhang"]
summary = "As a replacement of Matlab (I miss Matlab for its clean and concise grammar), numpy is the core library for scientific computing in Python. It provides a high-performance multidimensional array object, and tools for working with these arrays."
date = 2018-06-03T17:35:00+08:00
lastmod = 2018-06-03T17:36:00+08:00
tags = ["computer", "python"]
draft = false
+++

<style>
  .ox-hugo-toc ul {
    list-style: none;
  }
</style>
<div class="ox-hugo-toc toc">
<div></div>

## Table of Contents

- <span class="section-num">1</span> [Python](#python)
    - <span class="section-num">1.1</span> [Basic data types](#basic-data-types)
        - <span class="section-num">1.1.1</span> [numbers](#numbers)
        - <span class="section-num">1.1.2</span> [Booleans](#booleans)
        - <span class="section-num">1.1.3</span> [Strings](#strings)
    - <span class="section-num">1.2</span> [Containers](#containers)
        - <span class="section-num">1.2.1</span> [lists](#lists)
        - <span class="section-num">1.2.2</span> [Dictionaries](#dictionaries)
        - <span class="section-num">1.2.3</span> [Sets](#sets)
        - <span class="section-num">1.2.4</span> [Tuples](#tuples)
    - <span class="section-num">1.3</span> [Functions](#functions)
- <span class="section-num">2</span> [Numpy](#numpy)
    - <span class="section-num">2.1</span> [Arrays](#arrays)
    - <span class="section-num">2.2</span> [Array indexing](#array-indexing)
        - <span class="section-num">2.2.1</span> [slicing indexing](#slicing-indexing)
        - <span class="section-num">2.2.2</span> [integer array indexing](#integer-array-indexing)
        - <span class="section-num">2.2.3</span> [boolean array indexing](#boolean-array-indexing)
    - <span class="section-num">2.3</span> [Datatypes](#datatypes)
    - <span class="section-num">2.4</span> [Array math](#array-math)
    - <span class="section-num">2.5</span> [Broadcasting](#broadcasting)
- <span class="section-num">3</span> [summary](#summary)

</div>
<!--endtoc-->


## <span class="section-num">1</span> Python {#python}



As a high-level dynamically typed multiparadigm programming language, python
is attracts more and more attensions. Because of its strict indentation
requirement, python code has some beauty in it.

Using Emacs and IPython, I finished the [tutorial](http://cs231n.github.io/python-numpy-tutorial/) written by [Justin Johnson](https://cs.stanford.edu/people/jcjohns/) .
The following sections share the same architecture as in the tutorial.
However, for the sake of learning, I input all the code and add my
understanding. Because I learn Matlab beforehand, some differencec between
Matlab and Python are mentioned. During the learning, I use python 3.6
instead of python 3.5 in the tutorial.


### <span class="section-num">1.1</span> Basic data types {#basic-data-types}



Like most languages, Python has a number of basic types including integers,
floats, booleans, and strings.


#### <span class="section-num">1.1.1</span> numbers {#numbers}



Numbers include integer and float types and work as in other language.

```python
x = 3
print(type(x)) # Prints "<class 'int'>"
print(x)       # Prints "3"
print(x+1)     # Addition; prints "4"
print(x-1)     # Subtraction; print "2"
print(x*2)     # Multiplication; prints "6"
print(x**2)    # Exponentiation; print "9"
x += 1
print(x)       # Print "4"
x *= 2
print(x)       # Print "8"
y = 2.5
print(type(y)) # Print "<class 'float'>"
print(y, y+1, y*2, y**2) # Prints "2.5 3.5 5.0 6.25"
```

Python has `+=`  , `*=` , `-=` , `/=`  operators. However `a++` and `a--`
are not supported in Python.


#### <span class="section-num">1.1.2</span> Booleans {#booleans}



Different from Matlab, Python use `and` , `or` to implement Booleans
logic. In Matlab, which was implemented using `&&` and `||` .

```python
t = True
f = False
print(type(t)) # Prints "<class 'bool'>"
print(t and f) # logical AND; prints "False"
print(t or f)  # logical or; prints "True"
print(not t)   # logical NOT; print "False"
print(t != f)  # logical XOR; prints "True"
```

In matlab "not equal" was symbolized by `~=` instead of `!=` .


#### <span class="section-num">1.1.3</span> Strings {#strings}



I think Python support more on strings.

```python
hello = 'hello' # String lterals can use single quotes
world = "world" # double quotes; has the same effects as single ones
print(hello)    # Prints hello
print(len(hello)) #String length; prints "5"
hw = hello + ' ' + world # String concatenation
print(hw) # prints "hello world"
hw12 = '%s %s %d' % (hello,world,12)
print(hw12) # Prints "hello world 12"
```

In Python3.6, there is a handy sting called f-string. The last two lines
code above can be written as:

```python
print(f'{hello} {world} 12')
```

Quite a lot of methods are provided for strings:

```python
s = "hello"
print(s.capitalize())   # Capitalize a string; prints "Hello"
print(s.upper()) # Print "HELLO"
print(s.rjust(7)) # right-justify a string, padding with spaces;
print(s.center(7)) # center a string, padding with space;
print(s.replace('l','(ell)')) # replace all instances of one substring
#with another
```

More methods can be found [in the document](https://docs.python.org/3.5/library/stdtypes.html#string-methods).


### <span class="section-num">1.2</span> Containers {#containers}



There are four built-in container types: lists, dictionaries, sets and
tuples.


#### <span class="section-num">1.2.1</span> lists {#lists}



A list is the Python equivalent of an array, but is resizeable and can
contain element of different types.

```python
xs = [3,1,2] # Create a list
print(xs,xs[2]) # prints "[3,1,2] 2"
print(xs[-1]) # print the last element; print "2"
xs[2] = 'foo' # different  types
print(xs) # print "[3,1,'foo']"
xs.append('bar')
print(xs) # print "[3,1,'foo','bar']"
x = xs.pop()
print(x,xs) # prints "bar [3,1,'foo']"
```

As usual, you can find all the gory details about lists [in the document](https://docs.python.org/3.5/tutorial/datastructures.html#more-on-lists).

If you are impatient to access list elements one at a time, slicing is an
excellent choice to access more than one elements in a list.

```python
nums = list(range(5)) # range is a built-in function that create a list of integers
print(nums) # print "[0,1,2,3,4]"
print(nums[2:4]) # get a slice from index 2 to 4 (exclusive);print "[2,3]"
print(nums[2:]) # prints "[2,3,]"
print(nums[:2]) # get a slice from the start to index 2(exclusive). prints "[0,1]"
print(nums[:]) # the whole list
print(nums[:-1]) # slice indices can be negative; prints "[0,1,2,3]"
nums[2:4] = [8,9]
print(nums) # Prints "[0,1,8,9,4]"
```

You can also loop over the elements of a list like this:

```python
animals = ['cat', 'dog','monkey']
for animal in animals:
    print(animal)
```

If you want access to the index of each element within the body of a loop,
use the built-in `enumerate` function

```python
animals = ['cat','dog','monkey']
for idx,animal in enumerate(animals):
    print('#%d: %s' % (idx + 1,animal))
```

Next, I want to show a point which does not exists in Matlab: list
comprehensions. Consider the following code:

```python
nums = [0,1,2,3,4]
squares = []
for x in nums:
    squares.append(x ** 2)
print(squares)
```

Using the list comprehensions, we implement the above with extremely short
code.

```python
nums = [0,1,2,3,4]
squares = [x ** 2 for x in nums]
print(squares)
```

You do not have to define `square` before you use it. list comprehensions
can also contain conditions:

```python
nums = [0,1,2,3,4]
even_squares = [x ** 2 for x in nums if x % 2 == 0]
print(even_squares)
```
