content_org/computer.org
***** Dictionaries
      [2018-06-02 Sat 20:58]

      The values in a dictionary are pairs of =(key,value)= . You can access the
      value through the key just like what you do when you look up a dictionary.

      Dictionary type use ={}= as the limiters.

      #+begin_src python
      d = {'cat':'cute','dot':'furry'} # Create a new dictionary with some data
      print(d['cat']) # Get an entry from a dictionary using the key 'cat'
      print('cat' in d) # Prints "True"; check if a dictionary has a given entry
      d['fish'] = 'wet' # set a new entry in a dictionary
      print(d['fish'])  # print "wet"
      print(d.get('monkey','N/A')) # get an element with a default; print "N/A"
      print(d.get('fish','N/A')) # Print "wet"
      del d['fish'] # remove an element from a dictionary
      print(d.get('fish','N/A')) # Print "N/A"
      #+end_src

      More methods for dictionary can be found [[https://docs.python.org/3.5/library/stdtypes.html#dict][in the document.]]

      Like in list, you can also loop in a dictionary. The different is that in
      a dictionary, you loop using the keys.

      #+begin_src python
      d = {'person':2, 'cat':4,'spider':8}
      for animal in d:
          legs = d[animal]
          print(f'a {animal} has  {legs} legs')
      #+end_src

      The output will be:
      #+begin_example
      a person has  2 legs
      a cat has  4 legs
      a spider has  8 legs
      #+end_example


      Also, there is dictionary comprehensions, which are similar to list
      comprehensions, but allow you to easily construct dictionaries.

      #+begin_src python
      nums = [0,1,2,3,4]
      even_num_to_square = {x: x**2 for x in nums if x % 2 == 0}
      print(even_num_to_square)
      #+end_src

      Notice that you can even print a dictionary directly using the =print=
      function.
***** Sets
      [2018-06-02 Sat 21:46]


      A set is a collection of distinct elements. Notice the world *distinct*. A
      set has the same meaning what a mathematician mean. In particular, in a
      set there are not two identical elements. Set use ={}= as the limiter the
      same as dictionary.

      #+begin_src python
      animals = {'cat','dog'}
      print('cat' in animals) # True
      print('fish' in animals) # False
      animals.add('fish') # add 'fish' in the set
      print('fish' in animals) # True
      print(len(animals)) # 3
      animals.add('cat') # add 'cat' second time, nothing happen
      print(len(animals)) # 3
      animals.remove('cat') # remove 'cat' from the set
      print(len(animals)) # 2
      #+end_src

      You can find more about set [[http://cs231n.github.io/python-numpy-tutorial/#python-sets][in the document]].

      You can also iterate over a set. Since sets are unordered, you cannot make
      assumptions about the order in which you visit the elements of the set.

      #+begin_src python
      animals = {'cat','dog','fish'}
      for idx,animal in enumerate(animals):
          print(f'# {idx} : {animal}')
      #+end_src

      And the output will be:
      #+begin_example
      # 0 : fish
      # 1 : cat
      # 2 : dog
      #+end_example

      Like lists and dictionarier, sets can be constructed by set
      comprehensions.
      #+begin_src python
      from math import sqrt
      nums = {int(sqrt(x)) for x in range(20)}
      print(nums)
      #+end_src

      The output will be:
      #+begin_example
      {0,1,2,3,4}
      #+end_example
***** Tuples
      [2018-06-03 Sun 11:26]

      Tuple is the fourth container in Python. A tuple is an immutable ordered
      list of values. A tuple is in many ways similiar to a list. One of the
      most important differences is that tuples can be used as keys in
      dictionaries and as elements of sets, while lists cannot. Let's take a
      look at a trivial example.

      A tuple is enclosed in parentheses. It is not possible to assign to the
      individual items of a tuple. However, it is possible to create tuples
      which contain mutable objects, such as lists.

      #+begin_src python
      d = {(x,x+1):x for x in range(10)} # create a dictionary
      t = (5,6) # create a tuple
      print(type(t)) # <class 'tuple'>
      print(d[t]) # 5
      print(d[(1,2)]) # 1
      #+end_src

      You can find more about tuples [[https://docs.python.org/3.5/tutorial/datastructures.html#tuples-and-sequences][in the document.]]
**** Functions
      [2018-06-03 Sun 11:37]

      Python function are defined using the =def= keyword. For example:
      #+begin_src python
      def fib(n):
          """Print a fibonacci series up to n"""
          a,b = 0,1
          while a < n:
              print(a,end = ' ')
              a,b = b,a+b
          print()
      #+end_src

      The keyword =def= introducs a function definition which must be followed
      by the function name and the parenthesized list of formal parameters. The
      statements that form the body of the function start at the next line, and
      must be indented.


      Sometimes, we want to define functions that have default arguments, like
      this:
      #+begin_src python
      def hello(name, loud=False):
          if loud:
              print(f'HELLO, {name.upper()}')
          else:
              print(f'Hello, {name}')
      #+end_src

      Notice that =loud= will be =False= by default. If you call the function
      =hello= with asignning any value to =loud=, it will be =False=.  Of
      course, you can call =hello= using =hello('Bob',True)= . You can also call
      =hello= using =hello('Bob',loud=True)= .

      You can find more about define a function [[https://docs.python.org/3.5/tutorial/controlflow.html#defining-functions][in the document.]]
*** Numpy
     [2018-06-03 Sun 11:53]

     As the core library of scientific computing in Python, Numpy make Python a
     replacement of Matlab even when there are quite a lot of differences
     between Numpy and Matlab. Because of open course, Numpy gets quite a lots
     of features to support scientific computation.
**** Arrays
    [2018-06-03 Sun 11:59]

    A numpy array is a grid of values. All the values share the same type. A
    numpy array can be indexed by a tuple of nonnegative integers. The number of
    dimensions is the rank of the array. The shape of an array is a tuple of
    integers giving the size of the array along each dimension.

    We can create a numpy arrays from nested Python lists, and access elements
    using square brackets.
    #+begin_src python
    import numpy as np
    a = np.array([1,2,3])
    print(type(a))
    print(a.shape)
    print(a[0],a[1],a[2])
    a[0] = 5
    print(a)

    b = np.array([[1,2,3],[4,5,6]])
    print(b.shape)
    print(b[0,0],b[0,1],b[1,0])
    print(b.ndim)
    #+end_src

    As in Matlab, numpy also provides many functions to create special arrays:
    #+begin_src python
    import numpy as np

    a = np.zeros((4,4))
    print(a)

    b = np.ones((2,2))
    print(b)

    c = np.full((2,2),9)
    print(c)

    d = np.eye(2)
    print(d)

    e = np.random.random((2,2))
    print(e)
    #+end_src

    Another two useful methods are =arange= and =linspace=
    #+begin_src python
    import numpy as np

    a = np.arange(10) #exclude 10
    print(a)

    b = np.linspace(1,4,6) #include 4
    print(b)
    #+end_src

    More methods can be found [[https://docs.scipy.org/doc/numpy/user/basics.creation.html#arrays-creation][in the document]].
**** Array indexing
     [2018-06-03 Sun 12:28]

     You can access the element of an array one by one or more than one at a
     time. I like slicing very much. Because it is an effective way to access
     more than one elements at a time.
