content_org/computer.org
***** slicing indexing
      [2018-06-03 Sun 16:23]
      #+begin_src python
      import numpy as np

      a = np.array([[1,2,3,4],
                    [5,6,7,8],
                    [9,10,11,12]])
      b = a[:2,1:3]
      print(b)
      c = a[::2,0::2]
      print(c)

      #+end_src
      The output will be:
      #+begin_example
     [[2 3]
      [6 7]]
     [[ 1  3]
      [ 9 11]]
      #+end_example

      Notice that:
      1. In python, index starts from zero instead of one. (In Matlab, index
         starts from one)
      2. the slicing has the form =start:stop:step= , which mean start from the
         =start= and stop at =stop= (exclusive) with step as =step=

      In Python, negative integer can also be used as index which provides
      flexibility for accessing the elements in an array.

      One important thing about slicing is that the origin one and the sliced
      result are closely related. please take a look at [[https://www.zcl.space/computer/copy-and-deep-copy-in-python/][this post]].

      Let's follow the above example.
      #+begin_src python
      b[0,0] = 99
      print(b)
      print(a)
      #+end_src

      And the output will be:
      #+begin_example
      [[99  3]
       [ 6  7]]

      [[ 1 99  3  4]
       [ 5  6  7  8]
       [ 9 10 11 12]]
      #+end_example

      Notice that the =99= appears at =b[0,0]= and =a[0,1]= . I did not set
      =a[0,1]= explicitly, but it was changed.

      When you index the numply arrays using slicing, the resulting array view
      will always be a subarray of the original way. If you change the subarray,
      the origin array will be changed too. This is pretty weird for engineer
      coming from Matlab.
***** integer array indexing
       [2018-06-03 Sun 16:23]

       Another way of indexing array is integer array indexing. For example:
       #+begin_src python
       import numpy as np
       a = np.array([[1,2],
                     [3,4],
                     [5,6]])

       print(a[[0,1,2],[0,1,0]])
       #+end_src

       Notice that integer array indexing does not have the effect of "view". You
       can change the new array resulting from integer array indexing without
       worry about changing the origin array.

       Another advantage of integer array indexing is that you can modify certain
       positions of an array at a time. For example:
       #+begin_src python
       import numpy as np

       a = np.array([[1,2,3],
                     [4,5,6],
                     [7,8,9],
                     [10,11,12]])

       print(a)

       #Create an array of indices
       b = np.array([0,2,0,1])
       # Select one element from each row of the array
       # using the indices in b

       print(a[np.arange(4),b])

       a[np.arange(4),b] += 10

       print(a)
       #+end_src

       Notice that only some positions of the array =a= are added 10. The
       positions are represented by =np.arange(4),b= . I think this is of high
       efficiency.
***** boolean array indexing
      [2018-06-03 Sun 16:23]

      Boolean array indexing is another method of indexing an array. In matlab,
      there is boolean array indexing too. According to my experience, boolean
      array indexing is used to pick up certain elements of an array satisfying
      cerntain conditions.

      #+begin_src python
      import numpy as np
      a = np.array([[1,2],
                    [3,4],
                    [5,6]])
      # bool_idx are positions where
      # the elements are greater than 2
      bool_idx = (a > 2)

      print(bool_idx)

      print(a[bool_idx])
      print(a[a>2])
      #+end_src

      The shape of =bool_idx= is the same as =a= . The value of =bool_idx= is
      =True= where =a>2= satisfies. The last line tells us that we can finish
      the finding of positions and picking up the elements in one concise
      statement.


      You can find more on indexing [[https://docs.scipy.org/doc/numpy/reference/arrays.indexing.html][in the document.]]
**** Datatypes
      [2018-06-03 Sun 16:33]

      Every numpy array is a grid of elements of the same type. Numpy provides a
      large set of numeric datatypes that you can use to construct arrays. Numpy
      tries to guess a datatype when you create an array, but functions that
      construct arrays usually also include an optional argument to explicitly
      specify the datatype. For example:
      #+begin_src python
      import numpy as np
      x = np.array([1,2])
      print(x.dtype)

      x = np.array([1.0,2.0])
      print(x.dtype)

      x = np.array([1,2],dtype=np.int64)
      print(x.dtype)

      x = np.random.random((1,2))
      print(x.dtype)

      x = np.array([1+5j,2 + 4j])
      print(x.dtype)
      #+end_src
      The output is :
      #+begin_example
      int64
      float64
      int64
      float64
      complex128
      #+end_example

      Notice that for a complex number, numpy use the =complex128= to
      indicate the datetype.
**** Array math
     [2018-06-03 Sun 16:44]

     It is always more efficient to do algebra in vector mode so that the
     computation is expected to be finished in a parallel way. Because
     everything in python is object, the operators can be overloaded.

     #+begin_src python
     import numpy as np

     x = np.array([[1,2],[3,4]],dtype=np.float64)
     y = np.array([[5,6],[7,8]],dtype=np.float64)


     print(x+y)
     print(np.add(x,y))
     #+end_src

     One point that needs our attention is the matrix multiplication. There are
     two types of multiplication between matrices: one is elementwise
     multiplication and the other one is matrix multiplication. In Matlab, we
     use =*= to implement the matrix multiplication and =.*= to implement the
     elementwise multiplication. In Python, things are different. =*= is use to
     implement elementwise multiplication and =dot= is used to compute matrix
     multiplication.

     #+begin_src python
     import numpy as np

     x = np.array([[1,2],[3,4]])
     y = np.array([[5,6],[7,8]])

     v = np.array([9,10])
     w = np.array([11,12])

     # all the following 4 statements produce 219
     print(v.dot(w))
     print(w.dot(v))
     print(np.dot(v,w))
     print(np.dot(w,v))

     # matrix multiplication

     print(x.dot(y))
     print(np.dot(x,y))

     # AB != BA
     print(y.dot(x))
     print(np.dot(y,x))
     #+end_src

     Like in Matlab, we can sum up the matrix along one axis.

     #+begin_src python
     import numpy as np

     x = np.array([ [1,2],[3,4] ])

     # sum all the elements of x
     print(np.sum(x))

     # sum along the column
     print(np.sum(x,axis=0))
     # sum along the row
     print(np.sum(x,axis=1))
     #+end_src

     Changing the shape of an array is also one frequent operation. The most
     used operation is transposing a matrix.
     #+begin_src python
     import numpy as np

     x = np.array([[1,2],[3,4]])

     print(x)
     print(x.T)
     #+end_src

     If you want to reshape an array, =shape= is used.

     #+begin_src python
     import numpy as np

     a = np.arange(12)
     print(a)

     b = a.reshape((3,4))
     print(b)
     #+end_src
     The output will be:
     #+begin_example
     [ 0  1  2  3  4  5  6  7  8  9 10 11]

     [[ 0  1  2  3]
     [ 4  5  6  7]
     [ 8  9 10 11]]
     #+end_example

     Notice that =np.arange(n)= will exclude the =n=. and from shape =(12,)= to
     shape =(3,4)=, Python write the =(3,4)= row first. However, in Matlab, it
     is column first.
