content_org/computer.org
**** Broadcasting
     [2018-06-03 Sun 17:10]


     In Matlab, if you want to add two  matrices, they must have the same
     dimension, or an error will be throwed out.  However, in Python there is a
     mechanism called "Broadcasting" which allow you to work with arrays with
     different shapes.

     Suppose we want to add a constant vector to each row of a matrix. We would
     like this:
     #+begin_src python
     import numpy as np

     x = np.array([[1,2,3],
                   [4,5,6],
                   [7,8,9],
                   [10,11,12]])

     v = np.array([1,0,1])

     #create an empty matrix with the same shape as x
     y = np.empty_like(x)

     for i in range(4):
         y[i,:] = x[i,:] + v

     print(y)
     #+end_src

     The above code implement what we want. However, from the eye of Python, it
     is not concise. You have to iterate over =x= . Python allows you broadcast
     the =v= to each row of =x=

     #+begin_src python
     import numpy as np

     x = np.array([[1,2,3],
                   [4,5,6],
                   [7,8,9],
                   [10,11,12]])
     v = np.array([1,0,1])
     y = x + v
     print(y)
     #+end_src

     It is so easy. It works even =x= has shape =(4,3)= and =v= has shape =(3,)=
     due to broadcasting.

     Broadcasting two arrays together follows theses rules:
     1. if the arrays do not have the same shape, prepend the shape of the lower
        array with 1s until both shapes have the same length.
     2. The two arrays are said to be compatible in a dimension if they have the
        same size in the dimension, of if one of the arrays has size 1 in that
        dimension.
     3. The arrays can be broadcast together if they are compatible in all
        dimensions.
     4. After broadcasting, each array behaves as if it had shape equal to the
        elementwise maximum of shapes of the two input arrays.
     5. In any dimension where one array had size 1 and the other array had size
        greater than 1, the first array behaves as if it were copied along that
        dimension.

     Please check [[http://scipy.github.io/old-wiki/pages/EricsBroadcastingDoc][this document]] and [[https://docs.scipy.org/doc/numpy/user/basics.broadcasting.html][this document]] for more explainations.
     Functions that support broadcasting is called the universal function. You
     can find all the available universal function in [[https://docs.scipy.org/doc/numpy/reference/ufuncs.html#available-ufuncs][this document]].
*** summary
     [2018-06-03 Sun 17:33]

     This post summrize some important aspects of Numpy. However, it is far to
     be like the [[https://docs.scipy.org/doc/numpy/reference/arrays.indexing.html][numpy refernence]]. You should check the numpy reference
     frequently when you are not sure what you are using.

